import os

time = 0
karma = 0


class for_text_game(object):
    """docstring for for_text_game"""

    def __init__(self, arg):
        self.arg = arg
        self.time = 0
        self.karma = 0

    def qestion_1():
        print('''\tВечер воскресенья был сказочный вы отлично провели время.\
\nТакого количества алкоголя в пересмешку с увеселительными порошками ваш\
\nорганизм не помнил со времён последнего мальчишника.\n\tВопшем было шикарно!\
\n\tИ вдруг вся идиллия была нарушена чем-то непонятным, оно жужжало, носилось\
\nнад вами как вертолёт иногда совершая посадки на ваш нос. Жуткое создание\
\nмуха нарушила ваш сон. Приоткрыв один глаз вы поняли что каким-то чудом \
\nоказались дома, и пытались поспать. Но ОНО вам явно пыталось помешать. \
\n\tНужно было срочно что-то сделать  убить гадину или попытаться заснуть.''')
        while x:
            answer = str(input('\nЧто-то сделать : '))
            if answer == 'убить гадину':
                os.system('cls')
                print('''\tУбив назойливое животное вы погрузились в сладкий\
\nсон, а нарушил его звон будильника, который напомнил что ДА уже б....\
\nпонедельник и пора шевелится, ибо шеф злобная скотина грозился уволить вас\
\nещё на прошлой неделе!''')
                karma += 1
                time += 0
                x = 0
                break
            if answer == 'попытаться заснуть':
                os.system('cls')
                print('''\tВы попытались заснуть, но у вас ничего не \
\nполучилось. Животное летало садилось вам на нос, угрозы не помогали, а тапки\
\nне достигали цели. В конце этого ада зазвонил будильник. Понедельник\
\nнаступил неожиданно и мучительно. Вас ждала работа и шеф.''')
                karma -= 1
                time += 10
                x = 0
                break
            print('\nВы делали явно что-то не то')
        input('\nтыкни 'Enter' для продолжения')
