import os

time = 0
karma = 0

print ('''	Вечер воскресенья был сказочный вы отлично провели время. Такого количества алкоголя 
в пересмешку с увеселительными порошками ваш организм не помнил со времён последнего мальчишника.
Вопшем было шикарно! 
И вдруг вся идилия была нарушена чем-то непонятным, оно жужжало, носилось над вами как 
вертолёт иногда совершая посадки на ваш нос. Жуткое создание муха нарушила ваш сон. Приоткрыв 
один глаз вы поняли что каким-то чудом оказались дома, и пытались поспать. Но ОНО вам явно пыталось 
помешать. 
	Нужно было срочно что-то сделать  убить гадину или попытатся заснуть  ''')

x = 1
while x:
	answer = str(input ('Что-то сделать: '))
	if answer == 'убить гадину':
		os.system('cls')
		print ('''   Убив назойливое животное вы погрузились в сладкий сон, а нарушил его звон будильника, 
который напомнил что ДА уже б.... понедельник и пора шевелится, ибо шеф злобная скотина грозился 
уволить вас ещё на прошлой неделе!

''')
		karma += 1
		time += 0
		x = 0 
		break
	if answer == 'попытаться заснуть':
		os.system('cls')
		print (''' Вы попытались заснуть, но у вас ничего не получилось. Животное летало садилось вам на нос, 
угрозы не помогали, а тапки не достигали цели. В конце этого ада зазвонил будильник. Понедельник 
наступил неожиданно и мучительно. Вас ждала работа и шеф.

''')
		karma -= 1
		time += 10
		x = 0
		break
	print ('Вы делали явно что-то не то')
input('тыкни чёто для продолжения')

#### Ванна ####
os.system('cls')
print ('''	Добравшись до ванны и посмотрев в зеркало, вы начали колебаться, пройти вам по стандартному 
списку дел совершаема в этом помещение, или ускорить процесс. Время поджимало, шеф ждал!  

''')

answer_1 = (input('Принять душ, да или нет, вот в чём вопрос: '))
if answer_1 == 'да':
	time += 10
	karma += 1
	print ('Отлично!')
elif answer_1 == 'нет':
	time += 0
	karma -= 1
	print ('Да ну нафиг с тем душем')
else:	
	print ('Долгие размышления привели к потере времени, короче и не помылся и время просрал')
time += -5
karma -= 1

answer_2 = (input('Причесатся и побрится : '))
if answer_2 == 'да':
	time += 10
	karma += 1
	print ('Отлично!')
elif answer_2 == 'нет':
	time += 0
	karma -= 1
	print ('Да ну нафиг с єтим всем')
else:
	print ('Долгие размышления привели к потере времени, и похож ты на Ежа')
time += -5
karma -= 1

answer_3 = (input('Почисить зубы : '))
if answer_3 == 'да':
	time += 5
	karma += 1
	print ('Отлично!')
elif answer_3 == 'нет':
	time += 0
	karma -= 1
	print ('Да ну нафиг с єтим всем')
else:
	print ('Долгие размышления привели к потере времени, а перегар это сила!')
time -= 5
karma -= 1
input('тыкни чёто для продолжения')

#### Одежда ####
os.system('cls')
print ('''	Следующая задача требовала от во истину титанических мысленных усилий, что одеть на работу! 
Выбрать в гардеробе из трёх вещей что одеть в понедельник на работу при жутком похмелье это да! 

И так у вас есть несколько вариантов:
1.	Рубашка и джинсы со вчерашней тусы, стильно и просто. 
2.	Новый костюм, который вы не решались одеть уже больше года. 
3.	Офигеное платье, стиль не ваш, но желание потусить в платье есть. 
4.	Да ну нафиг эту одежду пойду в чем мать родила!

''')
clothes = int(input('Выбирай уже: '))
if clothes == 1:
	karma -= 10
if clothes == 2:
	karma += 10
if clothes == 3:
	karma += 1000
input('тыкни чёто для продолжения')
#### Кухня ####

os.system('cls')
print (''' Короче в ване были да и приоделись вроде, хотя.... Надо проверить обходной лист, что не сделано, 
и на работу. Ах да не плохо было б перекусить. Бодрым шагом вы идёте на кухню. Открываете холодильник, 
и понимаете что это уже была ошибка. Ну сами подумайте холостяк, все выходные кутил, ну чего туда 
заглядывать. Короче можно сделать кофе и есть вероятность что те два куриных яйца ещё ОК. Вы колеблитесь 
норм холостяцкий завтрак кофе и яичница или просто кофе. Время идёт, но разбитый будильник в 
углу кухни уже об этом не знает!''')

breakfast = str(input('Ну и....: '))
if breakfast == 'кофе и яичница':
	print ('К чёрту шефа, завтрак важнее! Работа подождёт!')
	karma += 0
	time += 20
elif breakfast == 'кофе':
	print('Да блин времени и так нет!!! Кофе и погнали.')
	karma -= 10
	time += 5
else:
	print('А наручные часы говорил что в принципе можно уже и не идти на работу, так что завтрак отменяется.  ')
karma -= 50
time += 0
input('тыкни чёто для продолжения')

#### Выйти с квартиры ####
os.system('cls')
print ('''Вопшем все сделано для успешной отправки на работу и совершения новых трудовых подвигов 
если конечно шеф вас не уволит. Вы подходите к двери ииииии WTF......
На дверях висит амбарный замок, а самое странное кодовый. На полу лежит скомканая инструкция. 
В памяти всплывает конкурс на которм сие нано чюдо было выйграно, а по приходу домой успешно установлено, 
для повышения личной безопасности. Вспомнив добрыми словами разработчиков вы быстро листаете 
инструкуию. Которая торжественно вам сообщяет что  кодом является день когда деды победили!!!  ''')

timer = 0
for i in range(10):
	code = input('Накрутить код: ')
	timer += 1
	if code == '905':
		print('Я шмогла!!! Бегу на работу!!!')
		break
	elif  timer == 10:
		os.system('cls')
		print(''' Вы не смогли сломать кода, не вышли с дома, с рабоы уволили, и скорее всего померли с голоду

		Конец
		
		''')
		os.abort()

#### Выйти с квартиры ####
os.system('cls')
if clothes == 3:
	print(''' Выходя из домы вы повстречали самый дружелюбный партуль милиции. Ваш внешний вид
вогнал их в ступор, не каждый день увидиш мужика в вечернем платье. Бить вас не стали но плевки и
пожелания закончить жизнь в мучениях вы слышали ещё долго
		
		''')
if clothes == 4:
	print(''' Выходя из домы вы повстречали самый дружелюбный партуль милиции. Их реакция была 
очевидна. Копали вас долго и с пристрастием ибо нечего ходить по городу в чём мать родила.
Вопшем на работу вы не попали и жизнь закончилась.

Конец
		
		''')
	os.abort()
if karma < 0:
	print ('%s %i %s' % ('Добравшись до работы шеф негодовал, а вы ешё и опоздали на', time , 'минут. Вопшем шес себе сделал подарок на день рожденье и уволил вас. Конец!!!'))
if karma > 0 and karma < 500:
	print('%s %i %s' % ('Добравшись до работы шев уже начал омечат днюху был недоволен что вы опоздали на', time, 'минут. Вы отделались небольшим штрафом и сумели похмелится с шефом вопщем жизь в понедельник потихоньку начала налаживатся. Конец!!!'))
if karma > 500:
	print('Добравшись до работы шеф уже изрядно напразновался в свой день рожденье. Когда вы вошли в офис в вечернем платье он долго ржал. Сказал что так не смеялся давно. Вы получили премию и нормально похмелились с шефом. Но просил больше так неего не смешить. Конец!!!')
input()
