import os

time = 0
karma = 0

print('''\tВечер воскресенья был сказочный вы отлично провели время. Такого \
\nколичества алкоголя в пересмешку с увеселительными порошками ваш организм не\
\nпомнил со времён последнего мальчишника.\n\tВопшем было шикарно!
\n\tИ вдруг вся идиллия была нарушена чем-то непонятным, оно жужжало, носилось\
\nнад вами каквертолёт иногда совершая посадки на ваш нос. Жуткое создание\
\nмуха нарушила ваш сон. Приоткрыв один глаз вы поняли что каким-то чудом \
\nоказалисьдома, и пытались поспать. Но ОНО вам явно пыталось помешать. \
\n\tНужно было срочно что-тосделать  убить гадину или попытаться заснуть.''')

x = 1

while x:
    answer = str(input('\nЧто-то сделать : '))
    if answer == 'убить гадину':
        os.system('cls')
        print('''\tУбив назойливое животное вы погрузились в сладкий сон, а\
\nнарушил его звон будильника, который напомнил что ДА уже б.... понедельник и\
\nпора шевелится, ибо шеф злобная скотина грозился уволить вас ещё на прошлой\
\nнеделе!''')

        karma += 1
        time += 0
        x = 0
        break
    if answer == 'попытаться заснуть':
        os.system('cls')
        print('''\tВы попытались заснуть, но у вас ничего не получилось.\
\nЖивотное летало садилось вам на нос, угрозы не помогали, а тапки не \
\nдостигали цели. В конце этого ада зазвонил будильник. Понедельник наступил \
\nнеожиданно и мучительно. Вас ждала работа и шеф.''')
        karma -= 1
        time += 10
        x = 0
        break
    print('\nВы делали явно что-то не то')
input('\nтыкни чёто для продолжения')

# Ванна
os.system('cls')
print('''\tДобравшисьдо ванны и посмотрев в зеркало, вы начали колебаться,\
\nпройти вам по стандартному списку дел совершаема в этом помещение, или \
\nускорить процесс. Время поджимало, шеф ждал!''')

answer_1 = (input('\nПринять душ, да или нет, вот в чём вопрос: '))
if answer_1 == 'да':
    time += 10
    karma += 1
    print('\nОтлично!')
elif answer_1 == 'нет':
    time += 0
    karma -= 1
    print('\nДа ну нафиг с тем душем')
else:
    print('\nДолгие размышления привели к потере времени, короче и не \
        помылся и время просрал')
time += -5
karma -= 1

answer_2 = (input('\nПричесаться и побриться : '))
if answer_2 == 'да':
    time += 10
    karma += 1
    print('\nОтлично!')
elif answer_2 == 'нет':
    time += 0
    karma -= 1
    print('\nДа ну нафиг с этим всем')
else:
    print('\nДолгие размышления привели к потере времени, и похож ты на Ежа')
time += -5
karma -= 1

answer_3 = (input('\nПочистить зубы : '))
if answer_3 == 'да':
    time += 5
    karma += 1
    print('\nОтлично!')
elif answer_3 == 'нет':
    time += 0
    karma -= 1
    print('\nДа ну нафиг с этим всем')
else:
    print('\nДолгие размышления привели к потере времени, а перегар это сила!')
time -= 5
karma -= 1
input('\nтыкни чёто для продолжения')

# Одежда
os.system('cls')
print('''\tСледующая задача требовала от во истину титанических мысленных\
\nусилий, что одеть на работу!Выбрать в гардеробе из трёх вещей что одеть в\
\nпонедельник на работу при жутком похмелье это да!\
\nИ так у вас есть несколько вариантов:\
\n1.\tРубашка и джинсы со вчерашней тусы, стильно и просто.\
\n2.\tНовый костюм, который вы не решались одеть уже больше года.\
\n3.\tОфигеное платье, стиль не ваш, но желание потусить в платье есть.\
\n4.\tДа ну нафиг эту одежду пойду в чем мать родила!''')
clothes = int(input('\nВыбирай уже : '))
if clothes == 1:
    karma -= 10
if clothes == 2:
    karma += 10
if clothes == 3:
    karma += 1000
input('\nтыкни чёто для продолжения')

# Кухня
os.system('cls')
print('''\tКороче в ване были да и приоделись вроде, хотя.... Надо проверить\
\nобходной лист, что не сделано, и на работу. Ах да не плохо было б \
\nперекусить. Бодрым шагом вы идёте на кухню. Открываете холодильник, и \
\nпонимаете что это уже была ошибка. Ну сами подумайте холостяк, все выходные \
\nкутил, ну чего туда заглядывать. Короче можно сделать кофе и есть \
\nвероятность что те два куриных яйца ещё ОК. Вы колеблитесь норм холостяцкий \
\nзавтрак кофе и яичница или просто кофе. Время идёт, но разбитый будильник в \
\nуглу кухни уже об этом не знает!''')

breakfast = str(input('\nНу и....: '))
if breakfast == 'кофе и яичница':
    print('\nК чёрту шефа, завтрак важнее! Работа подождёт!')
    karma += 0
    time += 20
elif breakfast == '\nкофе':
    print('\nДа блин времени и так нет!!! Кофе и погнали.')
    karma -= 10
    time += 5
else:
    print('\nА наручные часы говорил что в принципе можно уже и не идти на \
\nработу, так что завтрак отменяется.')
karma -= 50
time += 0
input('\nтыкни чёто для продолжения')

# Выйти с квартиры
os.system('cls')
print('''\tВопшем все сделано для успешной отправки на работу и совершения \
\nновых трудовых подвигов если конечно шеф вас не уволит. Вы подходите к двери\
\nииииии WTF......На дверях висит амбарный замок, а самое странное кодовый. На\
\nполу лежит скомканная инструкция. В памяти всплывает конкурс на котором сие\
\nнано чюдо было выгравировано, а по приходу домой успешно установлено, для\
\nповышения личной безопасности. Вспомнив добрыми словами разработчиков вы\
\nбыстро листаете инструкцию. Которая торжественно вам сообщает что  кодом\
\nявляется день когда деды победили!!!''')

timer = 0
for i in range(10):
    code = input('\nНакрутить код : ')
    timer += 1
    if code == '905':
        print('\nЯ шмогла!!! Бегу на работу!!!')
        break
    elif timer == 10:
        os.system('cls')
        print('''\tВы не смогли сломать кода, не вышли с дома, с работы\
\nуволили, и скорее всего померли с голоду\n\nКонец!''')
        os.abort()

# Выйти с квартиры
os.system('cls')
if clothes == 3:
    print('''\tВыходя из дома вы повстречали самый дружелюбный патруль\
\nмилиции. Ваш внешний вид вогнал их в ступор, не каждый день увидишь мужика\
\nв вечернем платье. Бить вас не стали но плевки и пожелания закончить жизнь\
\nв мучениях вы слышали ещё долго''')
if clothes == 4:
    print('''\tВыходя из дома вы повстречали самый дружелюбный патруль\
\nмилиции. Их реакция была очевидна. Копали вас долго и с пристрастием ибо\
\nнечего ходить по городу в чём мать родила. Вопшем на работу вы не попали\
\nи жизнь закончилась.\n\nКонец!''')
    os.abort()
if karma < 0:
    print('%s %i %s' % ('\tДобравшись до работы шеф негодовал, а вы еще и \
\nопоздали на', time, 'минут. Вопшем шеф себе сделал подарок на день рожденье\
\nи уволил вас.\n\nКонец!!!'))
if karma > 0 and karma < 500:
    print('%s %i %s' % ('\tДобравшись до работы шев уже начал отмечает днюху\
\nбыл недоволен что вы опоздали на', time, 'минут. Вы отделались небольшим\
\nштрафом и сумели похмелится с шефом вопщем жизнь в понедельник потихоньку\
\nначала налаживаться.\n\nКонец!!!'))
if karma > 500:
    print('\tДобравшись до работы шеф уже изрядно напразновался в свой день\
\nрожденье. Когда вы вошли в офис в вечернем платье он долго ржал. Сказал что\
\nтак не смеялся давно. Вы получили премию и нормально похмелились с шефом.\
\nНо просил больше так его не смешить.\n\nКонец!!!')
input()
