winner_map = {1: (2, 3, 4, 5, 6, 7, 8),
              2: (3, 4, 5, 6, 7, 8, 9),
              3: (4, 5, 6, 7, 8, 9, 10),
              4: (5, 6, 7, 8, 9, 10, 11),
              5: (6, 7, 8, 9, 10, 11, 12),
              6: (7, 8, 9, 10, 11, 12, 13),
              7: (8, 9, 10, 11, 12, 13, 14),
              8: (9, 10, 11, 12, 13, 14, 15),
              9: (10, 11, 12, 13, 14, 15, 1),
              10: (11, 12, 13, 14, 15, 1, 2),
              11: (12, 13, 14, 15, 1, 2, 3),
              12: (13, 14, 15, 1, 2, 3, 4),
              13: (14, 15, 1, 2, 3, 4, 5),
              14: (15, 1, 2, 3, 4, 5, 6),
              15: (1, 2, 3, 4, 5, 6, 7)
              }
choice_map = {1: 'Камень',
              2: 'Огонь',
              3: 'Ножницы',
              4: 'Змея',
              5: 'Человек',
              6: 'Дерево',
              7: 'Волк',
              8: 'Губка',
              9: 'Бумага',
              10: 'Воздух',
              11: 'Вода',
              12: 'Дракон',
              13: 'Дьявол',
              14: 'Молния',
              15: 'Пистолет'
              }
choice_show = ('\nКамень - 1   Огонь - 2    Ножницы - 3  Змея - 4\
                \nЧеловек - 5  Дерево - 6   Волк - 7     Губка - 8\
                \nБумага - 9   Воздух - 10  Вода - 11    Дракон - 12\
                \nДьявол - 13  Молния - 14  Пистолет - 15')
