winner_map = {1: (2, 3, 4, 5, 6, 7, 8),
              2: (3, 4, 5, 6, 7, 8, 9),
              3: (4, 5, 6, 7, 8, 9, 10),
              4: (5, 6, 7, 8, 9, 10, 11),
              5: (6, 7, 8, 9, 10, 11, 12),
              6: (7, 8, 9, 10, 11, 12, 13),
              7: (8, 9, 10, 11, 12, 13, 14),
              8: (9, 10, 11, 12, 13, 14, 15),
              9: (10, 11, 12, 13, 14, 15, 1),
              10: (11, 12, 13, 14, 15, 1, 2),
              11: (12, 13, 14, 15, 1, 2, 3),
              12: (13, 14, 15, 1, 2, 3, 4),
              13: (14, 15, 1, 2, 3, 4, 5),
              14: (15, 1, 2, 3, 4, 5, 6),
              15: (1, 2, 3, 4, 5, 6, 7)
              }
choice_map = {1: 'Камень',
              2: 'Огонь',
              3: 'Ножницы',
              4: 'Змея',
              5: 'Человек',
              6: 'Дерево',
              7: 'Волк',
              8: 'Губка',
              9: 'Бумага',
              10: 'Воздух',
              11: 'Вода',
              12: 'Дракон',
              13: 'Дьявол',
              14: 'Молния',
              15: 'Пистолет'
              }
help_string = ('Камень побеждает: Огонь, Ножницы, Змею, Человека, Дерево, Волка, Губку.\
\n\nОгонь побеждает: Ножницы, Змею, Человека, Дерево, Волка, Губку, Бумагу.\
\n\nНожницы побеждают: Змею, Человека, Дерево, Волка, Губку, Бумагу, Воздух.\
\n\nЗмея побеждает: Человека, Дерево, Волка, Губку, Бумагу, Воздух, Воду.\
\n\nЧеловек побеждает: Дерево, Волка, Губку, Бумагу, Воздух, Воду, Дракона.\
\n\nДерево побеждает: Волка, Губку, Бумагу, Воздух, Воду, Дракона, Дьявола.\
\n\nВолк побеждает: Губку, Бумагу, Воздух, Воду, Дракона, Дьявола, Молнию.\
\n\nГубка побеждает: Бумагу, Воздух, Воду, Дракона, Дьявола, Молнию, Пистолет.\
\n\nБумага побеждает: Воздух, Воду, Дракона, Дьявола, Молнию, Пистолет, Камень.\
\n\nВоздух побеждает: Воду, Дракона, Дьявола, Молнию, Пистолет, Камень, Огонь.\
\n\nВода побеждает: Дракона, Дьявола, Молнию, Пистолет, Камень, Огонь, Ножницы.\
\n\nДракон побеждает: Дьявола, Молнию, Пистолет, Камень, Огонь, Ножницы, Змею.\
\n\nДьявол побеждает: Молнию, Пистолет, Камень, Огонь, Ножницы, Змею, Человека.\
\n\nМолния побеждает: Пистолет, Камень, Огонь, Ножницы, Змею, Человека, Дерево.\
\n\nПистолет побеждает: Камень, Огонь, Ножницы, Змею, Человека, Дерево, Волка.')

# rules = {'Камень побеждает': ('Огонь', 'Ножницы', 'Змею', 'Человека', 'Дерево', 'Волка', 'Губку'),
#          'Огонь побеждает': ('Ножницы', 'Змею', 'Человека', 'Дерево', 'Волка', 'Губку', 'Бумагу'),
#          'Ножницы побеждают': ('Змею', 'Человека', 'Дерево', 'Волка', 'Губку', 'Бумагу', 'Воздух'),
#          'Змея побеждает': ('Человека', 'Дерево', 'Волка', 'Губку', 'Бумагу', 'Воздух', 'Воду'),
#          'Человек побеждает': ('Дерево', 'Волка', 'Губку', 'Бумагу', 'Воздух', 'Воду', 'Дракона'),
#          'Дерево побеждает': ('Волка', 'Губку', 'Бумагу', 'Воздух', 'Воду', 'Дракона', 'Дьявола'),
#          'Волк побеждает': ('Губку', 'Бумагу', 'Воздух', 'Воду', 'Дракона', 'Дьявола', 'Молнию'),
#          'Губка побеждает': ('Бумагу', 'Воздух', 'Воду', 'Дракона', 'Дьявола', 'Молнию', 'Пистолет'),
#          'Бумага побеждает': ('Воздух', 'Воду', 'Дракона', 'Дьявола', 'Молнию', 'Пистолет', 'Камень'),
#          'Воздух побеждает': ('Воду', 'Дракона', 'Дьявола', 'Молнию', 'Пистолет', 'Камень', 'Огонь'),
#          'Вода побеждает': ('Дракона', 'Дьявола', 'Молнию', 'Пистолет', 'Камень', 'Огонь', 'Ножницы'),
#          'Дракон побеждает': ('Дьявола', 'Молнию', 'Пистолет', 'Камень', 'Огонь', 'Ножницы', 'Змею'),
#          'Дьявол побеждает': ('Молнию', 'Пистолет', 'Камень', 'Огонь', 'Ножницы', 'Змею', 'Человека'),
#          'Молния побеждает': ('Пистолет', 'Камень', 'Огонь', 'Ножницы', 'Змею', 'Человека', 'Дерево'),
#          'Пистолет побеждает': ('Камень', 'Огонь', 'Ножницы', 'Змею', 'Человека', 'Дерево', 'Волка')}
